'use client';

import { FaQuoteLeft, FaQuoteRight } from 'react-icons/fa';
import { Fade } from 'react-awesome-reveal';

const QuotePage = () => {
  const quotes = [
    'हामी चान्छौ ग्रीन टीकापुर, क्लिन टीकापुर।',
    'वनबाट जल जलबाट जिवन।',
    'प्रदुषण युत्तफ् बायु घट्छ मान्छेको आयु।',
    'बृक्ष लगाउ" पर्यावरण बचाउ।',
    'एक बृक्ष दश पुत्र समान।',
    'देश धर्मको नाता बृक्ष हाम्रो भ्राता।',
    'हराभरा वन सबेै भन्दा ठुलो धन।',
    'नलिउ" रुखको ज्यान धर्तीे हुन्छ रेगीस्तान।',
    'बृक्ष लगाउ" एक बार पफ्ल खाउ बारम्बार।',
    'बढ्छ भुमिमा प्रदुषण घट्छ धर्तीमा आभुषण।',
    'हाम्रो सुन्दर संसार वायु प्रदुषणको शिकार।',
    'रुखको धर्ती सान हो, जीवनको मुस्कान हो।',
    'बृक्ष धर्तीको भुषण दुर गर्छ प्रदुषण।',
    'जीवनको विविध अंग पर्यावरणको संग।',
    'जहाँ छ हरियाली, त्यहाँ छ खुशीयाली।',
    'नांगो धर्ती गर्छ पुकार, बृक्ष लगाई गरौँ श्रृगार।',
    'जन जन आऔ बृक्ष लगाऔ।',
    'हाम्रो राम्रो हालत स्वच्छ पर्यावरणको सौगात।',
    'नगरा"ै प्रकृतिसंग खेलवाड भेफ्ल्नु पर्ला तुपफन र बाढ।',
    'बृक्ष प्रकृतिको चौकीदार गरा"ै यसको स्याहार।',
    'मुत्तफ् गगन मुत्तफ् पवन वन प्रभुको खुला भवन।',
    'बृक्ष लगाआ"ै पूण्य कमाआ"ै समाज सेवा गरा"ै।',
    'पफेहर बढे दुषित स"ास पफ्र्ने वायु।',
    'रोग लाग्छ खर्च बढ्छ, घट्छ हाम्रो आयु।',
    'हामी बदलिए युग बदलिन्छ, हामी सुध्रीय युग सुध्रिन्छ।',
    'देव संस्कृतीका निर्माता, यज्ञ पिता गायत्री माता।',
    'जसले गर्छ आत्म सुधार, मिल्छ उसलाई प्रभुको प्यार।',
    'घर घरमा संद्विचार पफ्लौऔ", धर्तीलाई स्वर्ग बनाआ"ै।',
    'मनुष्य परिस्थितिको दास हाइन, उसको निर्माता नियन्त्रण स्वामी हो।',
    'जाती वंश एक समान एक पिताका सब समान।',
    'उन्नतीका यी दुई आधार सादा जिवन उच्च विचार।',
    'अध्यापक हुन एक युग निर्माता, छात्र राष्ट्रका भाग्य बिधाता।',
  ];

  return (
    <div className="bg-green-100 min-h-screen py-12">
      <div className="max-w-7xl mx-auto px-4 sm:px-6 lg:px-8">
        <h2 className="text-3xl font-bold text-green-800 text-center mb-8">
          चेतनामुलक नमुनाका बृक्षारोपणका भनाईहरु
        </h2>
        <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-4 gap-6">
          {quotes.map((quote, index) => (
            <div
              key={index}
              className="bg-white rounded-lg shadow-md p-6 flex flex-col items-center  transition duration-300 ease-in-out transform hover:-translate-y-1 hover:scale-105"
            >
              {' '}
              <Fade direction="up" triggerOnce={true}>
                <FaQuoteLeft className="text-green-600 text-2xl mb-2" />
                <p className="text-gray-700 text-center mb-2">{quote}</p>
                <FaQuoteRight className="text-green-600 text-2xl" />
              </Fade>
            </div>
          ))}
        </div>
      </div>
    </div>
  );
};

export default QuotePage;
