const AboutSection = () => {
  return (
    <section className="bg-white py-16">
      <div className="container mx-auto px-4">
        <h2 className="text-3xl font-bold text-green-800 mb-5">हाम्रो मिशन</h2>
        <p className="text-lg mb-4 text-gray-600 font-semibold">
          यो सस्थाले टीकापुरको ग्रामिण देखि शहरी क्षेत्रमा वातावरणीय सुधार
          ल्याउने र वन तथा वातावरण जस्तो अति महत्वपुर्ण विषयमा जनतालाई सचेत
          गराउन शहरी क्षेत्रमा जनचेतनात्मक शन्देश सहित सडक छेउ बृक्षारोपण
          कार्यक्रमको साथसाथै शहरी क्षेत्रमा चल्ने सवारी साधन रीक्सामा समेत
          उल्लेखित चेतना मुलक शन्देश पफ्लौउन रीक्सामा रहेको क्यारी ब्यागको ब्याक
          साईडमा हरीयाली चेतना पफ्लौउने किशिमका मुल मंत्र टीनको पातामा लेखि सो
          टीन लाई सोही रीक्साको ब्याक मा बेल्डीङ्ग गर्ने जसबाट हरीयाली सम्बन्धि
          ब्यापक प्रचार प्रशार हुने ।
        </p>
      </div>
    </section>
  );
};

export default AboutSection;
