import {
  Box,
  TableContainer,
  Table,
  Tbody,
  Thead,
  Td,
  Th,
  Tr,
} from '@chakra-ui/react';

const OpenSpace = () => {
  const data = [
    {
      'ब्लक नं.': '१',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) बल भद्र चोक<br>2) सिद्धार्थ चोक<br>3) भिमसेन चोक<br>4) लक्ष्मी प्रसाद चोक',
      'क्षेत्रफल तथा स्थान':
        'खड्ग चोक देखि इलाका प्रहरी कार्यालय हुदै खानेपानी टंकी देखि सामुदायिक एफ.एम. हुदै अस्पताल सम्मको क्षेत्र',
    },
    {
      'ब्लक नं.': '२',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) दीपक शाहको घर अगाडी<br>2) शेरब. खड्काको घर अगाडी<br>3) जनक लाल तिवारीको घर अगाडी<br>4) झनक डम्बर रावलको घर अगाडी<br>5) मोती सिंह सांवदको घर अगाडी<br>6) विजय शाहको घर अगाडी<br>7) मेहर सिंह बि.क.को घर अगाडी<br>8) आनन्द बि.क.को घर अगाडी<br>9) मुकती नारायण शाहको घर अगाडी<br>10) दूरसंचार अगाडी<br>11) गोकर्ण प्र. रीमालको घर अगाडी<br>12) अनिल कोईरालाको घर अगाडी<br>13) मल्लजीको घर अगाडी<br>14) वीर्ख ब. खड्काको घर अगाडी',
      'क्षेत्रफल तथा स्थान':
        'बिरेन्द्र विद्यामन्दिर जाने ठाडो बाटो देखि शिव मन्दिर हुदै बहुमुखी क्याम्पस जाने पक्की पुल देखि दक्षिण सामुदायिक एफ.एम. सम्मको क्षेत्र',
    },
    {
      'ब्लक नं.': '३',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) खानेपानी टंकी अगाडी<br>2) योगेन्द्र बजगाईंको अगाडी<br>3) गणेश सावदको घर पुरब<br>4) बलब. विष्टको घर अगाडी<br>5) न्यौपाने जीको घरको अगाडी',
      'क्षेत्रफल तथा स्थान':
        'बिरेन्द्र विद्यामन्दिर जाने बाटो दक्षिण, आंखा अस्पताल जाने बाटो देखि उत्तर, पुरानो खानेपानी टंकीको बाटो पुरब, बिरेन्द्र विद्यामन्दिर जाने बाटो बाट पश्चिम साथै बिरेन्द्र विद्यामन्दिरको नयां प्लानिङ्ग भित्रको क्षेत्र',
    },
    {
      'ब्लक नं.': '४',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) सुरत विष्टजीको अगाडी<br>2) यज्ञमुर्ति अर्यालको अगाडी<br>3) न्यूलाइटको अगाडी<br>4) काजी साहबको घरको अगाडी<br>5) बिरेन्द्र क्याम्पसको अगाडी',
      'क्षेत्रफल तथा स्थान':
        'खड्गचोक देखि पश्चिम, गुम्बा देखि पुरब, जाल्पा देवी मन्दिर देखि दक्षिण, काछी बजार देखि गुम्बा जाने ठाडो रोड बाट उत्तर',
    },
    {
      'ब्लक नं.': '५',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) कृष्णब. रावलको घर पछाडी<br>2) धनी गिरीको घरको पछाडी<br>3) प्रहरी कार्यालयको पश्चिम',
      'क्षेत्रफल तथा स्थान':
        'गुम्बा जाने सडक देखि दक्षिण, मनुवा जाने सडक देखि उत्तर, खक्रौला सडक देखि पश्चिम, १५० फुटे सडक देखि पुरबको क्षेत्र',
    },
    {
      'ब्लक नं.': '६',
      'ओपन स्पेस तथा बनेका गार्डेन': '',
      'क्षेत्रफल तथा स्थान':
        'गुम्बा रोड जाने बाटो गोलचोक देखि पश्चिम, १५० फीट सडक बाट पुरब, मनुवा सडक देखि उत्तर, आरामिल बाट २४नं.को १५० फुटे रोड सम्म',
    },
    {
      'ब्लक नं.': '७',
      'ओपन स्पेस तथा बनेका गार्डेन': '',
      'क्षेत्रफल तथा स्थान':
        'गुम्बा रोड मा रहेको चोक देखि फुलबारी एफ.एम. सम्म बाट दक्षिण, आरामिल जाने सडक देखि उत्तर, १५० फुटे बनगाउ जाने सडक बाट पुरब, १५० फुटे बाइपास रोड देखि पश्चिम',
    },
    {
      'ब्लक नं.': '८',
      'ओपन स्पेस तथा बनेका गार्डेन': '1) गणेश मन्दिर क्षेत्र',
      'क्षेत्रफल तथा स्थान':
        'त्रिपाठी जीको घर देखि गुम्बा हुदै पश्चिम, मिश्रा जीको घर देखि पुरब, मनुवा रोड उत्तर, जमरा दक्षिणको क्षेत्र',
    },
    {
      'ब्लक नं.': '९',
      'ओपन स्पेस तथा बनेका गार्डेन': '1) सत्यराज तिमिल्सेनाको घर अगाडी',
      'क्षेत्रफल तथा स्थान':
        'बसपार्क देखि दक्षिण, तल्लो ब्यावसायिक क्षेत्रबाट उत्तर, ऐरपोर्ट बाट जाने बंगला रोड देखि पश्चिम, खक्रौला सडक देखि पुरबको क्षेत्र',
    },
    {
      'ब्लक नं.': '१०',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) अनाथालयको अगाडी<br>2) निरंकारी भवन पछाडी',
      'क्षेत्रफल तथा स्थान':
        'बंगला रोड पुरब, सितापुर स्कुल पश्चिम, खड्ग मेमोरियल बो.स्कुल दक्षिण, ब्यावसायिक क्षेत्र देखि उत्तरको क्षेत्र',
    },
    {
      'ब्लक नं.': '११',
      'ओपन स्पेस तथा बनेका गार्डेन': '1) कर्णाली मा.वि.को अगाडीको ओपन स्पेस',
      'क्षेत्रफल तथा स्थान':
        'खक्रौला शडक पश्चिम, बस पार्क उत्तर, कर्णाली मा.वि. दक्षिण, कर्मचारी बसोबास क्षेत्र पुरबको एरिया',
    },
  ];

  return (
    <div className="mx-auto pl-10 py-8">
      <p className="text-lg text-green-800 mb-8">
        यस टीकापुर नगरका नगरपीता स्वर्गिय श्री खडग बहादुर सिहको अतुलनिय योगदानमा
        २०२८ सालमा टीकापुर बिकास समिती स्थापना गरी सो को माध्यामबाट नगर एक
        उद्यान अनेक बिशेषता भएको नगर को नगर रेखाअंकन गरी नेपालकै नमुना बगैचाको
        शहर परीकल्पना हाम्रो लागि उपहार हो । यहां करीब ८८ वटा को हाराहारीमा
        यस्ता ओपन स्पेश रहेको सबैमा अनुरोध गर्न चाहन्छौ ।
      </p>
      <Box my={8}>
        <TableContainer className="rounded-lg shadow overflow-x-auto border border-gray-300">
          <Table variant="simple" className="w-full border border-gray-300">
            <Thead>
              <Tr className="border-b border-gray-300">
                <Th className="font-bold text-left px-4 py-2 border-r border-gray-300">
                  ब्लक नं.
                </Th>
                <Th className="text-left px-4 py-2 border-r border-gray-300">
                  ओपन स्पेसतथा बनेका गार्डेन
                </Th>
                <Th className="text-left px-4 py-2">क्षेत्रफल तथा स्थान</Th>
              </Tr>
            </Thead>
            <Tbody>
              {data.map((item, index) => (
                <Tr key={index} className="border-b border-gray-300">
                  <Td className="text-left px-4 py-2 border-r border-gray-300">
                    {item['ब्लक नं.']}
                  </Td>
                  <Td
                    className="text-left px-4 py-2 border-r border-gray-300"
                    dangerouslySetInnerHTML={{
                      __html: item['ओपन स्पेस तथा बनेका गार्डेन'],
                    }}
                  ></Td>
                  <Td className="text-left px-4 py-2">
                    {item['क्षेत्रफल तथा स्थान']}
                  </Td>
                </Tr>
              ))}
            </Tbody>
          </Table>
        </TableContainer>
      </Box>
    </div>
  );
};

export default OpenSpace;
