import React from 'react';
import {
  TableContainer,
  Table,
  Tbody,
  Thead,
  Td,
  Th,
  Tr,
} from '@chakra-ui/react';

const ExperienceTable = () => {
  const data = [
    {
      'क.स.': '१',
      'कार्यक्रम विवरण': 'शडक छेउ व्यवस्थित वृक्षारोपण',
      'कार्यकम स्थल':
        'ईलाका प्रशासन देखि सामुदायिक एफ.एम. सम्म दोहरी लाइन (टीकापुर) २०६९ बिरुवा संख्या १०५०, १ कि.मि.',
      अवधि: '४ महिना',
      'सहयोगि निकायः': 'जिल्ला वन कार्यालय धनगढी कैलाली',
    },
    {
      'क.स.': '२',
      'कार्यक्रम विवरण': '" "',
      'कार्यकम स्थल':
        'खुलामंच देखि पार्कजाने बाटो बस पार्क हुदै खड्ग स्मृती रंगशालासम्म (टीकापुर, कैलाली। २०७० विरुवा संख्या ५००१ कि.मि.',
      अवधि: '२ महीना',
      'सहयोगि निकायः': 'तराई भुपरीधि कार्यक्रम ताल धनगढी',
    },
    {
      'क.स.': '३',
      'कार्यक्रम विवरण': '" "',
      'कार्यकम स्थल':
        'टीकापुरको मध्य भाग ब्लक न.१४ खुला मंच हुदै आ.र.एम.ई.तथा फुलबारी एफ.एम. सम्म करीब १.५ कि.मि. सम्म रोपण गरीएको बिरवा सख्या १०७५',
      अवधि: '२ महीना',
      'सहयोगि निकायः': 'जिल्ला वन कार्यालय धनगढी कैलाली',
    },
    {
      'क.स.': '४',
      'कार्यक्रम विवरण': '" "',
      'कार्यकम स्थल': 'खुलामंच बाटो क्षेत्र १५४ थान (७०० मिटर टीकापुर)',
      अवधि: '२ महिना',
      'सहयोगि निकायः': 'टीकापुर स्थित बोर्डिङ्ग स्कूल तथा सामुदायिक वन हरु',
    },
    {
      'क.स.': '५',
      'कार्यक्रम विवरण': '" "',
      'कार्यकम स्थल': 'व्याबसायक्षेत्र (टीकापुर) १७४ थान ७५० मिटर',
      अवधि: '२ महिना',
      'सहयोगि निकायः': 'पब्लीकहरुको स्वस्फुर्त योगदान',
    },
    {
      'क.स.': '६',
      'कार्यक्रम विवरण': '" "',
      'कार्यकम स्थल':
        'अन्य विभिन्न स्थान २४५ थान ९५० मिटर प्रतिष्ठान द्वारा सहभागी गराईएका विभिन्न संघ सस्थाहरु',
      अवधि: '१ महिना',
      'सहयोगि निकायः': 'प्रतिष्ठान द्घारा सहभागि गराईएका बिभिन्न संघ संस्थाहरु',
    },
    {
      'क.स.': '७',
      'कार्यक्रम विवरण': '" "',
      'कार्यकम स्थल':
        'टीकापुरको ब्लक न. ५,१३ र मनुवा रोड २०७१ विरुवा ५१५ वान क्षेत्रफल १.५ कि.मि.',
      अवधि: '२ महिना',
      'सहयोगि निकायः': 'तराई भुपरीधि कार्यक्रम ताल धनगढी',
    },
    {
      'क.स.': '८',
      'कार्यक्रम विवरण': '" "',
      'कार्यकम स्थल':
        'आ.ब. २०७१।२०७२ को कार्यक्रम अनुसार रु.८,७७,७५०।— आठ लाख सतहत्तर हजार को लागतमा टीकापुरका--बिभिन्न स्थान ६.५ कि.मि.बिरुवा संख्या १८१० वडा.न.९ब्लक न.९,१०,१५,१६,१७,१८, सहीत जमरा पारी गण देखि न.पा. सिमा सम्म बृक्षारोपण गरीएको ।',
      अवधि: '२ महिना',
      'सहयोगि निकायः':
        'जिल्ला बन कार्यालय धनगढी कैलालीको आर्थिक लगानिमा सम्पन्न भएको ।',
    },
    {
      'कार्यक्रम विवरण': 'जम्मा',
      'कार्यकम स्थल': ' बिरुवा संख्या ५५२३ क्षेत्रफल ७ कि.मि. ७०० मीटर',
    },
  ];

  return (
    <TableContainer className="rounded-lg shadow overflow-x-auto">
      <Table variant="simple" className="w-full">
        <Thead>
          <Tr>
            <Th className="font-bold text-left px-4 py-2">क.स.</Th>
            <Th className="text-left px-4 py-2">कार्यक्रम विवरण</Th>
            <Th className="text-left px-4 py-2">कार्यकम स्थल</Th>
            <Th className="text-left px-4 py-2">अवधि</Th>
            <Th className="text-left px-4 py-2">सहयोगि निकाय</Th>
          </Tr>
        </Thead>
        <Tbody>
          {data.map((item) => (
            <Tr key={item['क.स.']}>
              <Td className="text-left px-4 py-2">{item['क.स.']}</Td>
              <Td className="text-left px-4 py-2">{item['कार्यक्रम विवरण']}</Td>
              <Td className="text-left px-4 py-2">{item['कार्यकम स्थल']}</Td>
              <Td className="text-left px-4 py-2">{item['अवधि']}</Td>
              <Td className="text-left px-4 py-2">{item['सहयोगि निकायः']}</Td>
            </Tr>
          ))}
        </Tbody>
      </Table>
    </TableContainer>
  );
};

export default ExperienceTable;
