'use client';

import React from 'react';
import Image from 'next/image';
import Link from 'next/link';

import { Swiper, SwiperSlide } from 'swiper/react';
import { FaAward } from 'react-icons/fa';
import {
  Box,
  TableContainer,
  Table,
  Tbody,
  Thead,
  Td,
  Th,
  Tr,
} from '@chakra-ui/react';

// Import Swiper styles
import 'swiper/css';
import 'swiper/css/pagination';
import 'swiper/css/navigation';

// import required modules
import { Autoplay, Pagination, Navigation } from 'swiper/modules';

const AboutPage = () => {
  const data = [
    {
      'ब्लक नं.': '१',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) बल भद्र चोक<br>2) सिद्धार्थ चोक<br>3) भिमसेन चोक<br>4) लक्ष्मी प्रसाद चोक',
      'क्षेत्रफल तथा स्थान':
        'खड्ग चोक देखि इलाका प्रहरी कार्यालय हुदै खानेपानी टंकी देखि सामुदायिक एफ.एम. हुदै अस्पताल सम्मको क्षेत्र',
    },
    {
      'ब्लक नं.': '२',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) दीपक शाहको घर अगाडी<br>2) शेरब. खड्काको घर अगाडी<br>3) जनक लाल तिवारीको घर अगाडी<br>4) झनक डम्बर रावलको घर अगाडी<br>5) मोती सिंह सांवदको घर अगाडी<br>6) विजय शाहको घर अगाडी<br>7) मेहर सिंह बि.क.को घर अगाडी<br>8) आनन्द बि.क.को घर अगाडी<br>9) मुकती नारायण शाहको घर अगाडी<br>10) दूरसंचार अगाडी<br>11) गोकर्ण प्र. रीमालको घर अगाडी<br>12) अनिल कोईरालाको घर अगाडी<br>13) मल्लजीको घर अगाडी<br>14) वीर्ख ब. खड्काको घर अगाडी',
      'क्षेत्रफल तथा स्थान':
        'बिरेन्द्र विद्यामन्दिर जाने ठाडो बाटो देखि शिव मन्दिर हुदै बहुमुखी क्याम्पस जाने पक्की पुल देखि दक्षिण सामुदायिक एफ.एम. सम्मको क्षेत्र',
    },
    {
      'ब्लक नं.': '३',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) खानेपानी टंकी अगाडी<br>2) योगेन्द्र बजगाईंको अगाडी<br>3) गणेश सावदको घर पुरब<br>4) बलब. विष्टको घर अगाडी<br>5) न्यौपाने जीको घरको अगाडी',
      'क्षेत्रफल तथा स्थान':
        'बिरेन्द्र विद्यामन्दिर जाने बाटो दक्षिण, आंखा अस्पताल जाने बाटो देखि उत्तर, पुरानो खानेपानी टंकीको बाटो पुरब, बिरेन्द्र विद्यामन्दिर जाने बाटो बाट पश्चिम साथै बिरेन्द्र विद्यामन्दिरको नयां प्लानिङ्ग भित्रको क्षेत्र',
    },
    {
      'ब्लक नं.': '४',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) सुरत विष्टजीको अगाडी<br>2) यज्ञमुर्ति अर्यालको अगाडी<br>3) न्यूलाइटको अगाडी<br>4) काजी साहबको घरको अगाडी<br>5) बिरेन्द्र क्याम्पसको अगाडी',
      'क्षेत्रफल तथा स्थान':
        'खड्गचोक देखि पश्चिम, गुम्बा देखि पुरब, जाल्पा देवी मन्दिर देखि दक्षिण, काछी बजार देखि गुम्बा जाने ठाडो रोड बाट उत्तर',
    },
    {
      'ब्लक नं.': '५',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) कृष्णब. रावलको घर पछाडी<br>2) धनी गिरीको घरको पछाडी<br>3) प्रहरी कार्यालयको पश्चिम',
      'क्षेत्रफल तथा स्थान':
        'गुम्बा जाने सडक देखि दक्षिण, मनुवा जाने सडक देखि उत्तर, खक्रौला सडक देखि पश्चिम, १५० फुटे सडक देखि पुरबको क्षेत्र',
    },
    {
      'ब्लक नं.': '६',
      'ओपन स्पेस तथा बनेका गार्डेन': '',
      'क्षेत्रफल तथा स्थान':
        'गुम्बा रोड जाने बाटो गोलचोक देखि पश्चिम, १५० फीट सडक बाट पुरब, मनुवा सडक देखि उत्तर, आरामिल बाट २४नं.को १५० फुटे रोड सम्म',
    },
    {
      'ब्लक नं.': '७',
      'ओपन स्पेस तथा बनेका गार्डेन': '',
      'क्षेत्रफल तथा स्थान':
        'गुम्बा रोड मा रहेको चोक देखि फुलबारी एफ.एम. सम्म बाट दक्षिण, आरामिल जाने सडक देखि उत्तर, १५० फुटे बनगाउ जाने सडक बाट पुरब, १५० फुटे बाइपास रोड देखि पश्चिम',
    },
    {
      'ब्लक नं.': '८',
      'ओपन स्पेस तथा बनेका गार्डेन': '1) गणेश मन्दिर क्षेत्र',
      'क्षेत्रफल तथा स्थान':
        'त्रिपाठी जीको घर देखि गुम्बा हुदै पश्चिम, मिश्रा जीको घर देखि पुरब, मनुवा रोड उत्तर, जमरा दक्षिणको क्षेत्र',
    },
    {
      'ब्लक नं.': '९',
      'ओपन स्पेस तथा बनेका गार्डेन': '1) सत्यराज तिमिल्सेनाको घर अगाडी',
      'क्षेत्रफल तथा स्थान':
        'बसपार्क देखि दक्षिण, तल्लो ब्यावसायिक क्षेत्रबाट उत्तर, ऐरपोर्ट बाट जाने बंगला रोड देखि पश्चिम, खक्रौला सडक देखि पुरबको क्षेत्र',
    },
    {
      'ब्लक नं.': '१०',
      'ओपन स्पेस तथा बनेका गार्डेन':
        '1) अनाथालयको अगाडी<br>2) निरंकारी भवन पछाडी',
      'क्षेत्रफल तथा स्थान':
        'बंगला रोड पुरब, सितापुर स्कुल पश्चिम, खड्ग मेमोरियल बो.स्कुल दक्षिण, ब्यावसायिक क्षेत्र देखि उत्तरको क्षेत्र',
    },
    {
      'ब्लक नं.': '११',
      'ओपन स्पेस तथा बनेका गार्डेन': '1) कर्णाली मा.वि.को अगाडीको ओपन स्पेस',
      'क्षेत्रफल तथा स्थान':
        'खक्रौला शडक पश्चिम, बस पार्क उत्तर, कर्णाली मा.वि. दक्षिण, कर्मचारी बसोबास क्षेत्र पुरबको एरिया',
    },
  ];

  return (
    <div className="bg-gray-100">
      <Swiper
        spaceBetween={30}
        centeredSlides={true}
        autoplay={{
          delay: 3000,
          disableOnInteraction: false,
        }}
        pagination={{
          clickable: true,
        }}
        modules={[Autoplay, Pagination, Navigation]}
        className="mySwiper mt-10"
      >
        <SwiperSlide>
          {' '}
          <Image
            src="/DSC_0038.jpg"
            alt="About Us"
            width={600}
            height={300}
            className="m-auto mt-8"
            objectFit="cover"
          />
        </SwiperSlide>
        <SwiperSlide>
          {' '}
          <Image
            src="/DSC_0010.JPG"
            alt="About Us"
            width={600}
            height={300}
            className="m-auto mt-8"
            objectFit="cover"
          />
        </SwiperSlide>
        <SwiperSlide>
          {' '}
          <Image
            src="/DSC_2612.JPG"
            alt="About Us"
            width={600}
            height={300}
            className="m-auto mt-8"
            objectFit="cover"
          />
        </SwiperSlide>
        <SwiperSlide>
          {' '}
          <Image
            src="/IMG_0007_1.JPG"
            alt="About Us"
            width={600}
            height={300}
            className="m-auto mt-8"
            objectFit="cover"
          />
        </SwiperSlide>
        <SwiperSlide>
          {' '}
          <Image
            src="/Picture381.jpg"
            alt="About Us"
            width={600}
            height={300}
            className="m-auto mt-8"
            objectFit="cover"
          />
        </SwiperSlide>
      </Swiper>
      <div className="container mx-auto px-4 py-16">
        <div className="grid grid-cols-1 md:grid-cols-2 gap-8">
          <div>
            <h1 className="text-4xl font-bold text-green-800 mb-6">
              हाम्रोबारे
            </h1>
            <p className="text-lg text-gray-700 mb-8">
              कैलाली जिल्ला टीकापुर न.पा. स्थित गठित यस श्री खड्ग बहादुर सिहं
              स्मृति प्रतिष्ठान बिगतका केही वर्षहरु देखि शुरुवात भई कार्य आरम्भ
              भई आएको भएता पनि लिखित रुपमा यो संस्था २०६५ सालमा जिल्ला प्रशासन
              कार्यालय धनगढीमा दर्ता भई यस क्षेत्रको सामाजिक, सामुदायिक चेतना
              स्तर बृद्धिकोलागी परिरहेको एक बिशुद्ध गैर सरकारी संस्था हो ।
            </p>
            <p className="text-lg text-gray-700 mb-8">
              सफा टीकापुर, हरियाली टीकापुर एक सफा र हरियाली टीकापुर सहर बनाउन
              समर्पित समुदाय-संचालित पहल हो। हाम्रो मिशन भनेको चेतना जगाउनु,
              दिगो अभ्यासहरू प्रवर्द्धन गर्नु, र नागरिकहरूलाई स्वस्थ र अधिक
              पर्यावरण-मैत्री वातावरण तर्फ कदम चाल्न प्रेरित गर्नु हो।
            </p>
            <p className="text-lg text-gray-700 mb-8">
              हामी विश्वास गर्छौं कि हरेक साना कदम गणना गर्दछ, र सँगै काम गरेर,
              हामीले हाम्रो प्रियजनको कल्याणमा महत्त्वपूर्ण प्रभाव पार्न सक्छौं
              शहर। हरियाली भविष्यतर्फको यो यात्रामा हामीसँग सामेल हुनुहोस्।
            </p>
            <Link
              href="/contact-us"
              className="inline-block bg-green-500 hover:bg-green-600 text-white font-semibold py-3 px-6 rounded-md transition duration-300"
            >
              संलग्न हुनुहोस्
            </Link>
          </div>
          <div className="relative">
            <Image
              src="/DSC_0038.jpg"
              alt="About Us"
              layout="responsive"
              objectFit="cover"
              width={800}
              height={100}
              className="rounded-lg shadow-lg"
            />
          </div>
        </div>
      </div>

      <div className="container mx-auto px-4 py-16 bg-white">
        <div className="grid grid-cols-1 md:grid-cols-2 gap-8">
          <div className="relative">
            <Image
              src="/DSC_0010.JPG"
              alt="Our Mission"
              layout="responsive"
              objectFit="cover"
              width={800}
              height={100}
              className="rounded-lg shadow-lg"
            />
          </div>
          <div>
            <h2 className="text-3xl font-bold text-green-800 mb-6">
              हाम्रो मिशन
            </h2>
            <p className="text-lg text-gray-700 mb-8">
              हाम्रो लक्ष्य भनेको सफा र हरियाली टीकापुर सहर बनाउने हो चेतना
              जगाउने, दिगो अभ्यासहरू प्रवर्द्धन गर्ने, र प्रेरणादायी नागरिकहरू
              स्वस्थ र अधिक पर्यावरण मैत्री तर्फ कार्य गर्न वातावरण।
            </p>
            <ul className="list-disc list-inside text-lg text-gray-700 mb-8">
              <li>
                सामुदायिक सफाई ड्राइभहरू र रिसाइक्लिंग पहलहरू व्यवस्थित
                गर्नुहोस्।
              </li>
              <li>वृक्षारोपण र हरियाली विकास प्रवर्द्धन गर्नुहोस्।</li>
              <li>
                फोहोर कम गर्न र अपनाउन नागरिकहरूलाई शिक्षित र सशक्त बनाउनुहोस्
                पर्यावरण अनुकूल बानीहरू।
              </li>
              <li>
                स्थानीय निकाय र सरोकारवालासँग सहकार्य गर्ने प्रभावकारी
                कार्यान्वयन।
              </li>
            </ul>
          </div>
        </div>
      </div>

      <div className="container mx-auto px-4 py-16 bg-white">
        <h2 className="text-3xl font-bold text-green-800 mb-6 flex items-center">
          <FaAward className="mr-2" /> सम्मानित ब्यक्तित्वहरू
        </h2>
        <p className="text-lg text-gray-700 mb-8">
          यस श्री खड्ग बहादुर सिहं स्मृती प्रतिष्ठान द्वारा सम्मानित
          ब्यक्तित्वहरु निम्नानुसार रहेका छन् ।
        </p>
        <ul className="list-decimal list-inside text-lg text-gray-700 mb-8 space-y-2">
          <li>
            श्री बशन्त के.सि. पौराणिक खेलकुद परीषद नेपाल (ग्रिन टीकापुर क्लीन
            टीकापुर) अभियानमा
          </li>
          <li>
            श्री भिमराम चपाई टीकापुर ९ खड्ग स्मृती प्रतिष्ठानमा महत्वपूर्ण
            योगदान रहेको
          </li>
          <li>
            श्री सरीता थापा रावल - ब्लक १५ योगदान रहेको गणपती गार्डेन निर्माण
            (नगर एक उद्यान अनेक कार्यक्रम)
          </li>
          <li>
            श्री टंक देवी थापा भण्डारी टीकापुर ९ ब्लक १६ आर्दश उद्यान निर्माण
            नगर एक उद्यान अनेक कार्यक्रम
          </li>
          <li>
            श्री मोतीसरा सांवद (खड्का) टीकापुर ९ ब्लक २४ तिनकुने गार्डेन नगर एक
            उद्यान अनेक कार्यक्रम
          </li>
          <li>
            श्री कल्पना आचार्य टीकापुर ९ ब्लक २५ रामारोसन गार्डेन नगर एक उद्यान
            अनेक कार्यक्रम
          </li>
          <li>
            श्री जानकी देवकोटा टीकापुर ९ ब्लक २४ अपी सैपाल गार्डेन नगर एक उद्यान
            अनेक कार्यक्रम
          </li>
          <li>
            श्री नवराज आचार्य टीकापुर ९ ब्लक २४ भवानी गार्डेन नगर एक उद्यान अनेक
            कार्यक्रम
          </li>
        </ul>
      </div>

      <div className="mx-auto pl-10 py-8">
        {' '}
        <p className="text-lg text-green-800 mb-8">
          यस टीकापुर नगरका नगरपीता स्वर्गिय श्री खडग बहादुर सिहको अतुलनिय
          योगदानमा २०२८ सालमा टीकापुर बिकास समिती स्थापना गरी सो को माध्यामबाट
          नगर एक उद्यान अनेक बिशेषता भएको नगर को नगर रेखाअंकन गरी नेपालकै नमुना
          बगैचाको शहर परीकल्पना हाम्रो लागि उपहार हो । यहां करीब ८८ वटा को
          हाराहारीमा यस्ता ओपन स्पेश रहेको सबैमा अनुरोध गर्न चाहन्छौ ।
        </p>
        <Box my={8}>
          <TableContainer className="rounded-lg shadow overflow-x-auto">
            <Table variant="simple" className="w-full">
              <Thead>
                <Tr>
                  <Th className="font-bold text-left px-4 py-2">ब्लक नं.</Th>
                  <Th className="text-left px-4 py-2">
                    ओपन स्पेसतथा बनेका गार्डेन
                  </Th>
                  <Th className="text-left px-4 py-2">क्षेत्रफल तथा स्थान</Th>
                </Tr>
              </Thead>
              <Tbody>
                {data.map((item, index) => (
                  <Tr key={index}>
                    <Td className="text-left px-4 py-2">{item['ब्लक नं.']}</Td>
                    <Td
                      className="text-left px-4 py-2"
                      dangerouslySetInnerHTML={{
                        __html: item['ओपन स्पेस तथा बनेका गार्डेन'],
                      }}
                    ></Td>
                    <Td className="text-left px-4 py-2">
                      {item['क्षेत्रफल तथा स्थान']}
                    </Td>
                  </Tr>
                ))}
              </Tbody>
            </Table>
          </TableContainer>
        </Box>
      </div>
    </div>
  );
};

export default AboutPage;
